zeha/xc32/pic32m-source/binutils/bfd/pic32-dinit.c
#ifndef __PIC32_DINIT__
#define __PIC32_DINIT__

#ifndef PIC32
#define PIC32
#endif

#include "sysdep.h"
#include "bfd.h"
#include "bfdlink.h"
#include "libbfd.h"
#include "libiberty.h"
#include "elf-bfd.h"
#include "limits.h"

#if defined(TARGET_IS_PIC32C)
#include "pic32c-utils.h"
#include "elf/arm.h"
#include "../ld/ldexp.h"
#include "../ld/ldlang.h"
#include "../ld/mchp/pic32c-emultempl.h"
#elif defined(TARGET_IS_PIC32M)
#include "pic32m-utils.h"
#endif

extern bfd_boolean  pic32_data_init;
extern bfd_boolean  pic32_has_data_init_option;
extern bfd_boolean  pic32_has_fill_option;
extern bfd_boolean  pic32_has_stack_option;
extern bfd_boolean  pic32_has_processor_option;
extern bfd_boolean  pic32_has_hardfloat_option;
extern bfd_boolean  pic32_has_softfloat_option;
extern bfd_boolean  pic32_code_in_dinit;
extern bfd_boolean  pic32_has_code_in_dinit_option;
extern bfd_boolean  pic32_dinit_in_serial_mem;
extern bfd_boolean  pic32_has_dinit_in_serial_mem_option;
extern bfd_boolean  pic32_dinit_has_absolute_address;
extern bfd_vma      dinit_address;
extern bfd_boolean  pic32_debug;

/*
* dinit_compress_level  = 0 -> legacy
*                       = 1 -> merge sections
*                       = 2 -> merge sections & repeated values 
*                       = 3 -> merge sections & repeated values & compression
*/
/* Set maximum as default */
unsigned int dinit_compress_level = 3;

/* Disable self check by default */
bfd_boolean dinit_self_check = FALSE;
/* Set to largest possible value to break tests in case real value isn't set
 * in fill_dinit_section
 */
int min_gain_repeated_2b = INT_MAX;
int min_gain_repeated_4b = INT_MAX;
int min_gain_compression = INT_MAX;

/* What startup routines to link */
unsigned int dinit_link_mask = 0;

/* Data Structures for the Data Init Template */
bfd             *init_bfd;
unsigned char   *init_data = NULL;
asection        *init_template = 0;
uint32_t        init_data_padding = 0;
static uint32_t saved_dinit = 0;


/* Data Structures for Input Data Sections */
extern struct pic32_section *data_sections;

/* Data Structures for Input Data Sections */
extern struct pic32_section *code_sections;

static void pic32_add_section_to_list
  (struct pic32_section *lst, asection *sec);

static void dinit_gen_repeated_value(PTR* fp, bfd_vma runtime_addr,
                                     bfd_vma runtime_size, uint32_t value,
                                     dinit_type data_type);
static void bfd_pic32_process_data_section
  (asection * const sec, PTR fp);
static void bfd_pic32_process_code_section
  (struct pic32_section * const s, PTR fp, bfd_boolean update_flags);
static void bfd_pic32_write_data_header
  (unsigned char **,  bfd_vma,  bfd_vma, uint16_t);
static unsigned int dinit_compress
  (unsigned char * const buf, unsigned int entry_len, PTR fp);
bfd_boolean is_compressable
  (PTR fp, unsigned int length);
static unsigned char *dinit_get_section_contents
  (asection*, bfd_boolean);
static uint32_t bfd_pic32_repeated_data_sections
  (struct pic32_section* sect, unsigned char** fp, bfd_boolean do_set);

/* Gets content from asection's input or output section depending on do_set */
static unsigned char *
dinit_get_section_contents(asection *sect, bfd_boolean do_set)
{
  unsigned char * buf;

  /*
  ** Note: We are extracting input section data
  ** from an output section.
  */

  if (do_set)
    buf = (unsigned char *)malloc(sect->output_section->size);
  else
    buf = (unsigned char *)malloc(sect->size);

  if (!buf)
  {
    fprintf(stderr, "Link Error: not enough memory for section contents\n");
    abort();
  }

  /* Reset the bfd file pointer, because
        there seems to be a bug with fseek()
        in Winblows that makes seeking to
        a position earlier in the file unreliable. */

  bfd_boolean got_contents = FALSE;

  if (do_set)
  {
    /* TODO: This hack turns off the SEC_IN_MEMORY flag for any output
       section that has it just so the contents can be retrieved.  It
       really should be temporary. */
    bfd_boolean hackflag = FALSE;
    if (sect->output_section->flags & SEC_IN_MEMORY)
    {
      sect->output_section->flags &= ~SEC_IN_MEMORY;
      hackflag = TRUE;
    }

    bfd_seek(sect->output_section->owner, 0, SEEK_SET);
    got_contents = !bfd_get_section_contents(sect->output_section->owner,
                                             sect->output_section, buf,
                                             sect->output_offset, sect->size);
    if (hackflag)
      sect->output_section->flags |= SEC_IN_MEMORY;
  }
  else
  {
    bfd_seek(sect->owner, 0, SEEK_SET);
    got_contents = !bfd_get_section_contents(sect->owner, sect, buf, 0,
                                             sect->size);
  }

  if (got_contents)
  {
    fprintf(stderr, "Link Error: can't load section %s contents\n", sect->name);
    abort();
  }

  return buf;
}

static void
pic32_add_section_to_list (struct pic32_section * lst,
                              asection *sec)
{
  struct pic32_section *s, *tail, *new;

  if (!(lst))
    return;
  /* create a new element */
  new = ((struct pic32_section *)
         xmalloc(sizeof(struct pic32_section)));
  new->next  = 0;
  new->sec  = sec;
  new->pic32_size = sec->size;
  new->children = NULL;
  new->attributes = 0 /*pic32_attribute_map(sec) */;
  new->file = NULL; /* not set at this point */
  new->dinit_type = -1;

  /* find the tail */
  for (s = lst; s != NULL; s = s->next)
    tail = s;

  tail->next = new;  /* add it */
}


/*
 * ** Write a data record header
 * */
static void
bfd_pic32_write_data_header(d, addr, len, format)
     unsigned char **d;
     bfd_vma addr;
     bfd_vma len;
     uint16_t format;
{
  addr &= 0xFFFFFFFF;

  /* write destination address */
  *(*d)++ = (unsigned char) (addr & 0xFF);
  *(*d)++ = (unsigned char) ((addr >> 8) & 0xFF);
  *(*d)++ = (unsigned char) ((addr >> 16) & 0xFF);
  *(*d)++ = (unsigned char) ((addr >> 24) & 0xFF);

  /* write destination length */
  *(*d)++ = (unsigned char) (len & 0xFF);
  *(*d)++ = (unsigned char) ((len >> 8) & 0xFF);
  *(*d)++ = (unsigned char) ((len >> 16) & 0xFF);
  *(*d)++ = (unsigned char) ((len >> 24) & 0xFF);

  /* write format code */
  *(*d)++ = (unsigned char) (format & 0xFF);
  *(*d)++ = (unsigned char) ((format >> 8) & 0xFF);
  *(*d)++ = 0;
  *(*d)++ = 0;
}

