zeha/xc32/pic32m-source/binutils/bfd/pic32-dinit.c
static bfd_boolean dinit_is_relocatable(asection * const sec)
{
  if (sec->reloc_count || sec->was_reloc || sec->flags & SEC_RELOC)
    return TRUE;
  return FALSE;
}

static bfd_boolean dinit_is_bss_section(asection * const sec)
{
  if ((PIC32_IS_BSS_ATTR(sec) || PIC32_IS_BSS_ATTR_WITH_MEMORY_ATTR(sec))
      && (sec->size > 0))
    return TRUE;
  return FALSE;
}

static bfd_boolean dinit_is_data_section (asection * const sec)
{
  if ((PIC32_IS_DATA_ATTR(sec) ||
        PIC32_IS_DATA_ATTR_WITH_MEMORY_ATTR(sec) ||
        PIC32_IS_RAMFUNC_ATTR(sec)) &&
        (sec->size > 0))
    return TRUE;
  return FALSE;
}

static bfd_boolean dinit_is_valid_section (asection * const sec)
{
  /* skip persistent or noload data sections*/
  if (PIC32_IS_PERSIST_ATTR(sec) || PIC32_IS_NOLOAD_ATTR(sec) || (sec->size == 0))
    {
      if (pic32_debug)
        fprintf(stderr, "  optim_dinit %s (skipped), size = 0x%x\n",
               sec->name, (unsigned int) sec->size);
      return FALSE;
    }
  return TRUE;
}

static void dinit_reset_section_flags(asection * const sect, bfd_boolean do_set)
{
  if (do_set)
  {
    Elf_Internal_Shdr *this_hdr;

    /* make section not LOADable */
    sect->output_section->flags &= ~SEC_LOAD;
    sect->output_section->flags |= SEC_NEVER_LOAD;

    sect->flags &= ~SEC_LOAD;
    sect->flags |= SEC_NEVER_LOAD;

    this_hdr = &elf_section_data(sect->output_section)->this_hdr;
    this_hdr->sh_flags |= SHF_NOLOAD;
  }
}

/*
** If the section is BSS or DATA, write the appropriate
** record into the data init template.
**
** ToDo: If the data section exceeds 64K, break into
** multiple records.
*/
static void bfd_pic32_process_data_section(asection * const sect, PTR fp)
{
  unsigned char *buf,*p;
  unsigned char **d = (unsigned char **) fp;
  bfd_vma runtime_size = sect->size;
  bfd_vma runtime_addr;

    if (sect == NULL)
        return;

    if (sect->output_section == NULL)
        return;

#ifdef TARGET_IS_PIC32C
    if (!sect->init)
    {
      if (pic32_debug)
	    fprintf (stderr, "  optim_dinit data_section %s (skipped, !init)\n", sect->name);
      return;
    }
#endif

    if (sect->size > 0)
      runtime_addr = sect->output_offset + sect->output_section->vma;
    else
      return;

  /* skip persistent or noload data sections */
  if (!dinit_is_valid_section(sect))
    return;

  /* process BSS-type sections */
  if (dinit_is_bss_section(sect))
    {
      if (pic32_debug)
        fprintf(stderr,
                "  optim_dinit %s (bss), size = 0x%x bytes, template addr = %lx\n",
                sect->name, (unsigned int) runtime_size,
                (long unsigned int) *d);

      /* write header only */
      bfd_pic32_write_data_header(d, runtime_addr, runtime_size, DINIT_CLEAR);
    }

   /* process DATA-type sections */
  if (dinit_is_data_section(sect))
    {
      if (pic32_debug)
        fprintf(stderr,
                "  optim_dinit %s (data), size = 0x%x bytes, template addr = %lx\n",
                sect->name, (unsigned int) runtime_size,
                (long unsigned int) *d);

      buf = dinit_get_section_contents(sect, TRUE);

      int count = 0;
      /* write header */
      bfd_pic32_write_data_header(d, runtime_addr, runtime_size, DINIT_COPY);

      for (p = buf; p < (buf + sect->size); )
      {
        *(*d)++ = *p++;
      }
      /* fill template with zeroes
        * padding for word alignment
        */
      count = sect->size % 4;
      if (count) while (count < 4) { *(*d)++ = 0; count++; }

      free(buf);

      /* make section not LOADable */
      dinit_reset_section_flags(sect, TRUE);
    } /* process DATA-type sections */

  return;
} /* static void bfd_pic32_process_data_section (...)*/


static void bfd_pic32_process_code_section(struct pic32_section * const s, PTR fp, bfd_boolean update_flags)
{
  unsigned char *buf,*p;
  unsigned char **d = (unsigned char **) fp;
  asection* sect = s->sec;

  bfd_vma runtime_size = sect->size;
  bfd_vma runtime_addr = sect->output_offset + sect->output_section->vma;

#ifdef TARGET_IS_PIC32C
    ///\ set runtime address for .vectors
    ///\ itcm origin
    if(!update_flags)
        runtime_addr = pic32c_itcm_vectors_address;
#endif

  if (PIC32_IS_CODE_ATTR(sect) && (sect->size > 0)
#ifdef TARGET_IS_PIC32C
        && sect->init
#endif
  )
    {
      if (pic32_debug)
        fprintf(stderr, "  optim_dinit %s (code), size = 0x%x bytes, template addr = %lx\n",
                sect->name, (unsigned int)runtime_size, (long unsigned int)*d);

      buf = dinit_get_section_contents(sect, TRUE);

      { int count = 0;
          /* write header */
          bfd_pic32_write_data_header(d, runtime_addr, runtime_size, DINIT_COPY);
          for (p = buf; p < (buf + sect->size); )
            {
              *(*d)++ = *p++;
              count ++;
              if (count == 4)
                count = 0;
            }
          /* fill template with zeroes */
          if (count) while (count < 4) { *(*d)++ = 0; count++; }

        free(buf);
#ifdef TARGET_IS_PIC32C
        if (update_flags)
#endif
          /* make section not LOADable */
          dinit_reset_section_flags(sect, TRUE);
    }
  }
}

/* check if 2 sections are compatible to be merged at dinit level */
static bfd_boolean are_dinit_compatible(asection * const s1, asection * const s2)
{
  /* Make sure we have output sections, this occurs when dinit is run before
	 allocation */
  if (!s1->output_section || !s2->output_section)
	return FALSE;

  bfd_vma s1_addr = s1->output_offset + s1->output_section->vma;
  bfd_vma s2_addr = s2->output_offset + s2->output_section->vma;


  if (s1 && s2
      /* same type */
      && ( (dinit_is_bss_section(s1) && dinit_is_bss_section(s2))
          || (dinit_is_data_section(s1) && dinit_is_data_section(s2)))
      /* continuous addresses */
      && ((s1_addr + s1->size) == s2_addr)
      )
      return TRUE;
  return FALSE;
}

static void
dinit_gen_repeated_value(PTR* fp, bfd_vma runtime_addr, bfd_vma runtime_size,
                         uint32_t value, dinit_type data_type)
{
    unsigned char **d = (unsigned char**)fp;
    
    bfd_pic32_write_data_header(d, runtime_addr, runtime_size,
                                        data_type);

    switch (data_type)
    {
      case DINIT_COPY_VAL_EMB:
            *d -= 2; /* Utilize zeros placed by write_data_header */
            *(*d)++ = (unsigned char)(value & 0xFF);
            *(*d)++ = (unsigned char)((value >> 8) & 0xFF);
          break;

      case DINIT_COPY_VAL_DATA:
            *(*d)++ = (unsigned char)(value & 0xFF);
            *(*d)++ = (unsigned char)((value >> 8) & 0xFF);
            *(*d)++ = (unsigned char)((value >> 16) & 0xFF);
            *(*d)++ = (unsigned char)((value >> 24) & 0xFF);
          break;

      default:
        break;
    }
}


