zeha/xc32/pic32m-source/binutils/bfd/pic32-dinit.c
/*
* select a repeated value type if possible, otherwise return copy 
*/
static dinit_type dinit_get_entry_type(struct pic32_section* sect, unsigned char** fp, bfd_boolean do_set)
{
  unsigned char*  buf = NULL;
  uint32_t        repeated_int;
  uint16_t        repeated_short;
  bfd_size_type   use_copy_val_int = 0;
  bfd_size_type   use_copy_val_short = 0;
  bfd_vma         runtime_addr = 0;
  unsigned char** d = (unsigned char**)fp;
	unsigned char*  p;

  if (do_set)
    runtime_addr = sect->sec->output_offset + sect->sec->output_section->vma;

  /* reloc sect->sections are always DINIT_COPY */
  if (dinit_is_relocatable(sect->sec))
    return DINIT_COPY;

  if (dinit_is_bss_section(sect->sec))
    return DINIT_CLEAR;

  buf = dinit_get_section_contents(sect->sec, do_set);

	repeated_int = *(uint32_t*)buf;
	repeated_short = *(uint16_t*)buf;
	bfd_boolean check_int = !(sect->sec->size % 4) && sect->sec->size > 4;
	bfd_boolean check_short = !(sect->sec->size % 2)  && sect->sec->size > 2;

	/* Check for repeated values */
	for (p = buf; p < (buf + sect->sec->size); p += 2)
	  {
		if (check_int && (uintptr_t) p % 4 == 0)
		  if (repeated_int == *(uint32_t *)p)
			use_copy_val_int++;

		if (check_short && repeated_short == *(uint16_t*)p)
		  use_copy_val_short++;
	  }

    free(buf);

	/* Ensure we only create a COPY_VAL_DATA/EMB type when the entire
        sect->section is the same repeated value */
    if ((!do_set && use_copy_val_short && (use_copy_val_short == sect->sec->size/2))
        || (do_set && (dinit_link_mask & GEN_DINIT_MASK(DINIT_COPY_VAL_EMB)) && (sect->dinit_type == DINIT_COPY_VAL_EMB)))
    {
      if(do_set)
        dinit_gen_repeated_value((void **) d, runtime_addr, sect->sec->size,
                               (uint32_t)repeated_short, DINIT_COPY_VAL_EMB);
      return DINIT_COPY_VAL_EMB;
    }

    if ((!do_set && use_copy_val_int && (use_copy_val_int == sect->sec->size/4))
        || (do_set && (dinit_link_mask & GEN_DINIT_MASK(DINIT_COPY_VAL_DATA))))
    {
      if (do_set)
        dinit_gen_repeated_value((void **) d, runtime_addr, sect->sec->size,
                               repeated_int, DINIT_COPY_VAL_DATA);
      return DINIT_COPY_VAL_DATA;
    }
    /* dinit is checked just for data, it can't be DINIT_CLEAR */
    return DINIT_COPY;
}

struct pic32_section*
bfd_pic32_process_merged_sections(struct pic32_section * const p32_start_sec, PTR fp, bfd_boolean do_set);
struct pic32_section*
bfd_pic32_process_merged_sections(struct pic32_section * const p32_start_sec, PTR fp, bfd_boolean do_set)
{
  asection *sect = p32_start_sec->sec;
  struct pic32_section *crt_sec;
  unsigned char *buf,*p;
  unsigned char **d = (unsigned char **) fp;
  bfd_vma runtime_size = sect->size;
  bfd_vma runtime_addr;
  unsigned char sec_type = 0; /* =1 ->bss, =2 ->data */
  /* keep a local list with the sections that can be merged in dinit */
  struct pic32_section *merged_sec = NULL, *tmp;
  uint32_t report_amount = 0;

  if (sect == NULL || (do_set && sect->output_section == NULL))
    return p32_start_sec->next;

  /* skip persistent or noload data sections - shouldn't happen!!!
   replace with assert */
  if (PIC32_IS_PERSIST_ATTR(sect) || PIC32_IS_NOLOAD_ATTR(sect))
    {
      if (pic32_debug)
        fprintf(stderr, "  optim_dinit %s (skipped), size = 0x%x\n",
               sect->name, (unsigned int) runtime_size);
      return p32_start_sec->next;
    }

  /* We can only merge if both sections are not optimized, this checks the
   * initial section.
   */
  if ((p32_start_sec && (p32_start_sec->dinit_type > DINIT_COPY) &&
          (dinit_link_mask & GEN_DINIT_MASK(p32_start_sec->dinit_type))))
    return p32_start_sec->next;

#ifdef TARGET_IS_PIC32C
  if (!sect->init)
    {
      if (pic32_debug)
        fprintf (stderr, "  optim_dinit data_section %s (skipped, !init)\n", sect->name);
      return p32_start_sec->next;
    }

#endif

  if (do_set && sect->size > 0)
      runtime_addr = sect->output_offset + sect->output_section->vma;
  else
      runtime_addr = 0;

  /* check if it is bss or data section*/
  dinit_is_bss_section(sect)? (sec_type = 1) : (sec_type = 2);

  /* build the list of consecutive sections that can be merged in dinit */
  /* using a stack address - not a good practice!!!*/
  pic32_init_section_list(&merged_sec);
  pic32_add_section_to_list(merged_sec, sect);

  /* check next section */
  crt_sec = p32_start_sec->next;

  while(crt_sec!= NULL)
  {
    while(crt_sec && !(dinit_is_valid_section (crt_sec->sec)))
    {
      crt_sec = crt_sec->next;
    }

    /* check if the section was already optimized
     * repeated values or compression -> it is not merged
     * this checks the current section.
     */
    if (crt_sec && (crt_sec->dinit_type > DINIT_COPY)
        && (dinit_link_mask & GEN_DINIT_MASK(crt_sec->dinit_type)))
      break;

    /* check if the sections can be merged */
    if (crt_sec && are_dinit_compatible(sect, crt_sec->sec))
    {

      runtime_size += crt_sec->sec->size;
      /* add the new section in the list */
      if (pic32_debug)
        fprintf(stderr,
                "  optim_dinit %s , addr: 0x%lx, size = 0x%x bytes & %s, addr: 0x%lx, size 0x%x",
                sect->name, runtime_addr, (unsigned int) sect->size,
                crt_sec->sec->name,
                crt_sec->sec->output_offset + crt_sec->sec->output_section->vma,
                (unsigned int) crt_sec->sec->size);
      pic32_add_section_to_list(merged_sec, crt_sec->sec);

      report_amount = saved_dinit;

      /* If section to be merged can fit inside of the zero padding of the
       * current section. This causes us to save another word. This only
       * applies to DINIT_COPY sections.
       */
      if ((((4 - ((runtime_size - crt_sec->sec->size) % 4)) + sect->size) <= 4)
          && crt_sec->dinit_type == DINIT_COPY
          && !do_set)
        saved_dinit += 4;

      if (!do_set) {
        saved_dinit += 12; /* HEADER size*/
        report_amount = saved_dinit - report_amount;
        if (pic32_debug)
          fprintf(stderr, ", saved 0x%x\n", report_amount);
      } else
        if (pic32_debug)
          fprintf(stderr, "\n");

      report_amount = 0;
      sect = crt_sec->sec;
      crt_sec = crt_sec->next;
    }
    else
      break;
  }
 if (!do_set)
 {
   pic32_free_section_list(&merged_sec);
   return crt_sec;
 }

 /*the list is complete - start filling .dinit */
  /* process BSS-type sections */
  if (sec_type == 1)
    {
      /* write header only */
      bfd_pic32_write_data_header(d, runtime_addr, runtime_size, DINIT_CLEAR);
    }
   /* process DATA-type sections */
  else
    {
      int count = 0;
      /* write header */
      bfd_pic32_write_data_header(d, runtime_addr, runtime_size, DINIT_COPY);

