zeha/xc32/pic32m-source/binutils/bfd/pic32-dinit.c
      for (tmp = merged_sec; tmp != NULL; tmp = tmp->next)
      {
          if (tmp->sec == NULL)
            continue;

        sect = tmp->sec;
        buf = dinit_get_section_contents(sect, do_set);

        if (do_set)
          for (p = buf; p < (buf + sect->size); )
            *(*d)++ = *p++;

      free(buf);
    }
    count = (4 - runtime_size%4)%4;

    /* padding with 0*/
    while (count != 0)
    {
      if (do_set)
        *(*d)++ = 0;

	  count--;
    }

    /* reset sections LOAD flags */
    for (tmp = merged_sec; tmp!= NULL; tmp = tmp->next)
        if (tmp->sec != NULL)
          dinit_reset_section_flags(tmp->sec, do_set);

    } /* process DATA-type sections */

  pic32_free_section_list(&merged_sec);
  return crt_sec;
} /* static struct pic32_section* bfd_pic32_process_merged_sections (...)*/


/*
* find the potential compression gain
*   on the char array
*/
int32_t dinit_get_compression_gain(asection *);
int32_t dinit_get_compression_gain(asection *sect)
{
  unsigned char *p;
  unsigned char *data = NULL;
  uint32_t length = sect->size;
  int32_t gain_bytes = 0; /* this one can be negative if there are just few 0's, not compensating the compression overhead */
  uint32_t nb_zero = 0;

  data = dinit_get_section_contents(sect, FALSE);

  for (p = data; p < (data + length); p++)
  {
    if (*p == 0) {
      if (nb_zero == 0xFF) {
        gain_bytes += nb_zero - 2;
        nb_zero = 1;
      }
      else
        nb_zero++;
    }
    else
    {
      if(nb_zero != 0)
      {
        gain_bytes += nb_zero - 2;
        nb_zero = 0;
      }
    }
  }
  if(nb_zero != 0)
    gain_bytes += nb_zero - 2;

  return (gain_bytes & 0xFFFFFFFC);
}

/**
 * Compress the buffer content
 * buf - holds the data to be compressed
 * entry_len - the length of the buffer
 * fp - where the compressed data is stored
 * returns the length of the compressed data
*/
static unsigned int dinit_compress (unsigned char * const buf,
                                    unsigned int entry_len, PTR fp)
{
  int length = 0, nb_zero=0, saved = 0;
  unsigned char **d = fp;
  unsigned char *p;

  BFD_ASSERT(buf != NULL);

  for (p = buf; p < (buf + entry_len); p++)
  {
    if(*p == 0)
    {
      if (nb_zero == 0xFF)
      {
        *(*d)++ = 0;
        *(*d)++ = 0xFF;
        saved += (nb_zero - 1);
        nb_zero = 1;
        length +=2; /* written bytes: < 0 | 0xFF > */
      }
      else
        nb_zero++;
    }
    else
    {
      if(nb_zero != 0)
      {
        *(*d)++ = 0;
        *(*d)++ = nb_zero;
        *(*d)++ = *p;
        nb_zero = 0;
        length += 3; /* written bytes: < 0 | nb_zero | *p > */
      }
      else
      {
        *(*d)++ = *p;
        length++;
      }
    }
  }

  if (nb_zero != 0)
  {
    *(*d)++ = 0;
    *(*d)++ = nb_zero;
    length += 2; /* written bytes: < 0 | nb_zero > */
  }

  int i = (4 - length%4)%4;

  /* padding with 0*/
  while (i != 0)
  {
    *(*d)++ = 0;
    i--;
  }
  return length;
}


static uint32_t
bfd_pic32_compress_data_section(struct pic32_section * const p32_start_sec, PTR fp)
{
  asection* sect = p32_start_sec->sec;
  unsigned char *buf = NULL,*p;
  unsigned char **d = (unsigned char **) fp;
  bfd_vma runtime_size = sect->size;
  bfd_vma runtime_addr;
  unsigned int count, saved = 0;

  if (sect == NULL)
      return 0;

  if (sect->output_section == NULL)
      return 0;

  /* skip persistent or noload data sections - shouldn't happen!!!
   replace with assert */
  if (PIC32_IS_PERSIST_ATTR(sect) || PIC32_IS_NOLOAD_ATTR(sect))
    {
      if (pic32_debug)
        fprintf(stderr, "  optim_dinit %s (skipped), size = 0x%x\n",
               sect->name, (unsigned int) runtime_size);
      return 0;
    }
#ifdef TARGET_IS_PIC32C
  if (!sect->init)
    {
      if (pic32_debug)
        fprintf (stderr, "  optim_dinit data_section %s (skipped, !init)\n", sect->name);
      return 0;
    }
#endif

  if (sect->size > 0)
    runtime_addr = sect->output_offset + sect->output_section->vma;
  else
    return 0;

  if (dinit_is_bss_section(sect))
  {
    /* write header */
    bfd_pic32_write_data_header(d, runtime_addr, runtime_size, DINIT_CLEAR);
    return 0;
  }

  buf = dinit_get_section_contents(sect, TRUE);
 
  if ((p32_start_sec->dinit_type == DINIT_COMPRESSED) 
      && (dinit_link_mask & (GEN_DINIT_MASK(DINIT_COMPRESSED)))
      && !dinit_is_relocatable(sect))
  {
    bfd_pic32_write_data_header(d, runtime_addr, runtime_size, DINIT_COMPRESSED);

    /*compress buffer*/
    count = 0; /* padded inside compression */
    saved = (sect->size - dinit_compress (buf,  sect->size, d)) & 0xFFFFFFFC; /* ensure 4-byte alignment*/
  }
  else
  {
    bfd_pic32_write_data_header(d, runtime_addr, runtime_size, DINIT_COPY);
    for (p = buf; p < (buf + sect->size); )
        *(*d)++ = *p++;

    count = (4 - runtime_size%4)%4;
  }

  /* padding with 0*/
  while (count != 0)
  {
    *(*d)++ = 0;
    count--;
  }

  free(buf);

  /* reset flags - make section not LOADable */
  dinit_reset_section_flags(sect, TRUE);
  return saved;
}

/*
* return the gain of repeated values
*/
static uint32_t
bfd_pic32_repeated_data_sections(struct pic32_section* sect, unsigned char** fp, bfd_boolean do_set)
{
  unsigned char **d = (unsigned char **) fp;
  dinit_type data_type = dinit_get_entry_type(sect, d, do_set);

  if (data_type == DINIT_COPY_VAL_DATA)
      return sect->sec->size - 4;
  else if (data_type == DINIT_COPY_VAL_EMB)
    return sect->sec->size;

  return 0;
}

static void
set_optimization_gain_min(bfd* ibfds)
{
  bfd* abfd;
#ifdef TARGET_IS_PIC32C
  uint32_t i;
  long symsize;
  asymbol **symbol_table;
  long number_of_symbols;
#endif

#ifdef TARGET_IS_PIC32MX
  #define DATA_INIT_OBJ "pic32_data_init_core.o"
#endif
#ifdef TARGET_IS_PIC32C
  #define DATA_INIT_OBJ "data_init.o"
#endif

    /* Size of _dinit_decompress and code to select branch */
    for (abfd = ibfds; abfd != (bfd *)NULL; abfd = abfd->link.next) {
      /*
       * Maybe we can get the archive and find the symbol's size somehow?
       * would be better than magic numbers. These numbers were obtained
       * by manually checking the size with dissasembly of the library files.
       */
      if (!strcmp(basename(abfd->filename), DATA_INIT_OBJ)) {
#ifdef TARGET_IS_PIC32MX
        if (_bfd_mips_is_micromips(abfd)) {
          min_gain_compression = 0x3e; /* bytes */
          min_gain_repeated_2b = 0x1e;
          min_gain_repeated_4b = 0x1a;
        }
        else
        {
          min_gain_compression = 0x68; /* bytes */
          min_gain_repeated_2b = 0x1c;
          min_gain_repeated_4b = 0x20;
        }
#endif
#ifdef TARGET_IS_PIC32C
        /* The approach we used on MIPS does not work for arm due to how
         * architecture information is set in the BFD.
         */
        symsize = bfd_get_symtab_upper_bound(abfd);

        if (symsize <= 0)
          break;

        symbol_table = (asymbol **)xmalloc(symsize);
        number_of_symbols = bfd_canonicalize_symtab(abfd, symbol_table);

        for (i = 0; i < number_of_symbols; i++)
          // Look for the Thumb/arm mode special symbols
          if (!strcmp(bfd_asymbol_name(symbol_table[i]), "$t")) {
            min_gain_compression = 0x46; /* bytes */
            min_gain_repeated_2b = 0x1e;
            min_gain_repeated_4b = 0x26;
            break;
          } else if (!strcmp(bfd_asymbol_name(symbol_table[i]), "$a")) {
            min_gain_compression = 0x70; /* bytes */
            min_gain_repeated_2b = 0x38;
            min_gain_repeated_4b = 0x44;
            break;
          }
        free(symbol_table);
#endif
        break;
        }
    }
    if (min_gain_compression == INT_MAX || min_gain_repeated_2b == INT_MAX
        || min_gain_repeated_4b == INT_MAX)
    {
      fprintf (stderr,
               "Warning: dinit optimization threshholds not set; dinit "
               "may not function\n");
    }
}

void estimate_dinit_optim(struct bfd_link_info *info)
{
  bfd_size_type         dinit_size;
  unsigned char         *dat;
  struct pic32_section  *s_sec;
  uint32_t              i;
  unsigned char         sec_type = 0;
  int32_t               saved_dinit_repeated_2b = 0, saved_dinit_repeated_4b = 0, saved_compression = 0;
  uint32_t              nb_repeated_2b = 0; /* number of sections optimized as repeated embedded values */

  if (!pic32_data_init)
    return;

  BFD_ASSERT (init_template != NULL);

  set_optimization_gain_min(info->input_bfds);
  
