zeha/xc32/pic32m-source/binutils/bfd/pic32-dinit.c
  if (pic32_debug)
    fprintf (stderr, "optim_dinit ... estimation DINIT pass\n");

  dinit_size = init_template->size;

  if (init_data == NULL)
    {
      init_data = (unsigned char *)malloc (dinit_size * sizeof (unsigned char));
      if (init_data == NULL)
      {
        fprintf (stderr, "Link Error: can't allocate dinit buffer\n");
        abort ();
      }
      memset (init_data, 0x11, dinit_size);
    }

  /* update the default fill value */
  dat = init_data;
  for (i=0; i < dinit_size; i++)
    *dat++ *= 2;

  /* scan sections and write data records */
  if (pic32_debug)
    fprintf(stderr, "\noptim_dinit estimating data sections:\n");
  dat = init_data;

  for (s_sec = data_sections; s_sec != NULL; )
  {
    if ((s_sec)
        && (s_sec->sec)
        && ((s_sec->sec->flags & SEC_EXCLUDE) == 0)
        && (s_sec->sec->output_section != bfd_abs_section_ptr)
        && (s_sec->sec->size > 0)
#ifdef TARGET_IS_PIC32C
        && (s_sec->sec->init != 0)
#endif
        )
    {
      /*
        * Set was_reloc before anything else, this attribute persists
        * across both passes ensuring we do not optimize relocatable
        * sections.
        */
      if (dinit_is_relocatable(s_sec->sec))
      {
        if (pic32_debug)
          fprintf(stderr,"  optim_dinit section %s COPY_RELOC, size = 0x%lx bytes\n",
                  s_sec->sec->name, s_sec->sec->size);
        s_sec->sec->was_reloc = TRUE;
        if (s_sec->sec->output_section)
            s_sec->sec->output_section->was_reloc = TRUE;
        dinit_link_mask |=  GEN_DINIT_MASK(DINIT_COPY);
        s_sec->dinit_type = DINIT_COPY;
        s_sec = s_sec->next;
        continue; /* no more analysis is needed, this one is just copied*/
      }

      dinit_is_bss_section(s_sec->sec)? (sec_type = 1) : (sec_type = 2);

      /* bss section cannot be optimized at this point */
      if (sec_type == 1)
      {
        /* set clear flag */
        if (pic32_debug)
          fprintf(stderr,"  optim_dinit section %s CLEAR, size = 0x%lx bytes\n",
                  s_sec->sec->name, s_sec->sec->size);
        dinit_link_mask |=  GEN_DINIT_MASK(DINIT_CLEAR);
        s_sec->dinit_type = DINIT_CLEAR;
        s_sec = s_sec->next;
        continue;
      }

      switch (dinit_compress_level)
      {
      case 0:
      case 1: /* merging cannot be done in this phase */
        dinit_link_mask |=  GEN_DINIT_MASK(DINIT_COPY);
        s_sec->dinit_type = DINIT_COPY;
        break;

      case 2:
      case 3:
      {
          int32_t tmp = 0;            
          tmp = bfd_pic32_repeated_data_sections(s_sec, &dat, FALSE);
          
          if (tmp != 0)
          {
            /* 1) set mask 
               2) set saved value
               3) add in map - section & optim type
            */
            if (dinit_get_entry_type(s_sec, &dat, FALSE) ==  DINIT_COPY_VAL_EMB)
            {
              dinit_link_mask |=  GEN_DINIT_MASK(DINIT_COPY_VAL_EMB);
              s_sec->dinit_type = DINIT_COPY_VAL_EMB;
              nb_repeated_2b += 1;
              saved_dinit_repeated_2b += tmp;
              if (pic32_debug)
                fprintf(stderr,"  optim_dinit section %s COPY_EMB, size = 0x%lx bytes, saved 0x%x\n",
                        s_sec->sec->name, s_sec->sec->size, tmp);
            }
            else 
            {
              dinit_link_mask |= GEN_DINIT_MASK(DINIT_COPY_VAL_DATA);
              s_sec->dinit_type = DINIT_COPY_VAL_DATA;
              saved_dinit_repeated_4b += tmp;
              if (pic32_debug)
                fprintf(stderr,"  optim_dinit section %s COPY_DATA, size = 0x%lx bytes, saved 0x%x\n",
                        s_sec->sec->name, s_sec->sec->size, tmp);
            }
          }
          else if ((tmp == 0) && (dinit_compress_level == 3))
          {
            /* get section content and analyze it*/
            tmp = dinit_get_compression_gain(s_sec->sec);
            if (tmp != 0)
            {
              dinit_link_mask |=  GEN_DINIT_MASK(DINIT_COMPRESSED);
              s_sec->dinit_type = DINIT_COMPRESSED;
              if (pic32_debug)
                fprintf(stderr,"  optim_dinit section %s COMPRESSED, size = 0x%lx bytes, saved 0x%x\n",
                        s_sec->sec->name, s_sec->sec->size, tmp);
              saved_compression += tmp;
            }
            else
            {
              if (pic32_debug)
                fprintf(stderr,"  optim_dinit section %s COPY, size = 0x%lx bytes, saved 0x%x\n",
                        s_sec->sec->name, s_sec->sec->size, tmp);
              dinit_link_mask |= GEN_DINIT_MASK(DINIT_COPY);
              s_sec->dinit_type = DINIT_COPY;
            }
          } 
          else
          {
            if (pic32_debug)
              fprintf(stderr,"  optim_dinit section %s COPY, size = 0x%lx bytes, saved 0x%x\n",
                      s_sec->sec->name, s_sec->sec->size, tmp);
            dinit_link_mask |=  GEN_DINIT_MASK(DINIT_COPY);
            s_sec->dinit_type = DINIT_COPY;
          }
          break;
        }

        default:
          BFD_ASSERT(0); // report error -> unknown compression level 
          break;
        }
      }
      s_sec = s_sec->next;
    }
  
  /* check the improvement */
  if (dinit_link_mask &  GEN_DINIT_MASK(DINIT_COPY_VAL_EMB))
  {
    if (saved_dinit_repeated_2b < min_gain_repeated_2b)
    {
      /* transform it into 4b */
      /* 4 - repeated 4b is 4 bytes larger than repeated 2b */
      saved_dinit_repeated_4b += (saved_dinit_repeated_2b - 4*nb_repeated_2b);
      /* reset flag */
      dinit_link_mask &= ~GEN_DINIT_MASK(DINIT_COPY_VAL_EMB);
      dinit_link_mask |= GEN_DINIT_MASK(DINIT_COPY_VAL_DATA);
      if (pic32_debug)
        fprintf(stderr,"  optim_dinit COPY_VAL_EMB => COPY_VAL_DATA, saved: 0x%x, thresh: 0x%x\n",
                saved_dinit_repeated_2b, min_gain_repeated_2b);
      saved_dinit_repeated_2b = 0;
    }
  }
  if (dinit_link_mask &  GEN_DINIT_MASK(DINIT_COPY_VAL_DATA))
  {
    if (saved_dinit_repeated_4b < min_gain_repeated_4b)
    {
      dinit_link_mask &= ~GEN_DINIT_MASK(DINIT_COPY_VAL_DATA);
      if (pic32_debug)
        fprintf(stderr,"  optim_dinit COPY_VAL_DATA => COPY, saved: 0x%x, thresh: 0x%x\n",
                saved_dinit_repeated_4b, min_gain_repeated_4b);
      saved_dinit_repeated_4b = 0;
      dinit_link_mask |= GEN_DINIT_MASK(DINIT_COPY);
    }
  }
  if (dinit_link_mask &  GEN_DINIT_MASK(DINIT_COMPRESSED))
  {
    if (saved_compression < min_gain_compression)
    {
      dinit_link_mask &= ~GEN_DINIT_MASK(DINIT_COMPRESSED);
      if (pic32_debug)
        fprintf(stderr,"  optim_dinit COMPRESSED => COPY, saved: 0x%x, thresh: 0x%x\n",
                saved_compression, min_gain_compression);
      saved_compression = 0;
      dinit_link_mask |= GEN_DINIT_MASK(DINIT_COPY);
    }
  }

  /* Now that we have finished downgrading sections we fix up ->dinit_type for
   * each one. This will simplify checking when outputting.
   */

