zeha/xc32/pic32m-source/binutils/bfd/pic32-dinit.c
  for (s_sec = data_sections; s_sec != NULL; s_sec = s_sec->next)
  {
    if ((s_sec) && (s_sec->sec) && (s_sec->dinit_type > 1))
    {
      if (!(dinit_link_mask & GEN_DINIT_MASK(DINIT_COPY_VAL_EMB))
            && s_sec->dinit_type == DINIT_COPY_VAL_EMB)
          s_sec->dinit_type = DINIT_COPY_VAL_DATA;

      if (!(dinit_link_mask & GEN_DINIT_MASK(DINIT_COPY_VAL_DATA))
            && s_sec->dinit_type == DINIT_COPY_VAL_DATA)
          s_sec->dinit_type = DINIT_COPY;

      if (!(dinit_link_mask & GEN_DINIT_MASK(DINIT_COMPRESSED))
           && s_sec->dinit_type == DINIT_COMPRESSED)
          s_sec->dinit_type = DINIT_COPY;
    }
  }

  if (pic32_debug) {
    fprintf(stderr,"  optim_dinit saved_dinit (no merge) COPY_EMB: 0x%x, COPY_VAL_DATA: 0x%x, COMPRESSION: 0x%x\n",
            saved_dinit_repeated_2b, saved_dinit_repeated_4b, saved_compression);
    fprintf(stderr, "optim_dinit estimating data sections done\n");
  }
  saved_dinit = saved_dinit_repeated_2b + saved_dinit_repeated_4b
                + saved_compression;

  /* no estimation needed on code, as code is just copied
   * check existence to enable COPY flag if we only have code.
   */
#ifdef TARGET_IS_PIC32MX
  if (pic32_code_in_dinit)
  {
#endif
    for (s_sec = code_sections; s_sec != NULL; s_sec = s_sec->next)
      if ((s_sec->sec) &&
          (s_sec->sec->size > 0) &&
          ((s_sec->sec->flags & SEC_EXCLUDE) == 0) &&
          (s_sec->sec->output_section != bfd_abs_section_ptr))
      {
#if TARGET_IS_PIC32C
          if (s_sec->sec->itcm)
#endif
          {
            if (pic32_debug)
              fprintf (stderr,
                       "  optim_dinit (code) section: %s size: 0x%x link "
                       "DINIT_COPY startup\n",
                       s_sec->sec->name, s_sec->sec->size);
            dinit_link_mask |= GEN_DINIT_MASK (DINIT_COPY);
          }
#ifdef TARGET_IS_PIC32C
          else if ((pic32c_relocate_vectors)
                   && s_sec->sec
                   && (strstr (s_sec->sec->name, ".vectors")
                       != NULL))
          {
            if (pic32_debug)
              fprintf (stderr,
                       "  optim_dinit (code) section: %s size: 0x%x link "
                       "DINIT_COPY startup\n",
                       s_sec->sec->name, s_sec->sec->size);
            dinit_link_mask |= GEN_DINIT_MASK (DINIT_COPY);
          }
#endif
      }
#ifdef TARGET_IS_PIC32MX
  }
#endif
}

/* We are really re-implementing most of create_data_init_template here,
 * not ideal
 *
 * This function returns a new .dinit section size if it grew, or 0 called by
 * the BFA.
 */

bfd_size_type check_dinit_growth(struct bfd_link_info *link_info) {
  bfd_size_type dinit_size = 0;
  uint32_t new_init_data_padding = 0;
  struct pic32_section* s_sec;

  if (!pic32_data_init)
    return 0;

  for (s_sec = code_sections; s_sec != NULL; s_sec = s_sec->next)
    if ((s_sec->sec) && (((s_sec->sec->flags & SEC_EXCLUDE) == 0) &&
                         (s_sec->sec->output_section != bfd_abs_section_ptr)))
#ifdef TARGET_IS_PIC32C
      if (s_sec->sec->itcm)
        dinit_size += ((s_sec->sec->size % 4)
                           ? (s_sec->sec->size + (4 - s_sec->sec->size % 4))
                           : s_sec->sec->size) + 12;

      else if (pic32c_vectors_in_tcm && s_sec->sec &&
               (strstr(s_sec->sec->name, ".vectors") != NULL))
        dinit_size += ((s_sec->sec->size % 4)
                           ? (s_sec->sec->size + (4 - s_sec->sec->size % 4))
                           : s_sec->sec->size) + 12;
#endif

  for (s_sec = data_sections; s_sec != NULL; s_sec = s_sec->next)
    if ((s_sec) && (s_sec->sec) && ((s_sec->sec->flags & SEC_EXCLUDE) == 0) &&
        (s_sec->sec->output_section != bfd_abs_section_ptr) &&
        (s_sec->sec->size > 0))
    {
#ifdef TARGET_IS_PIC32C
      if (!s_sec->sec->init)
        continue; 
#endif
      if (dinit_is_bss_section(s_sec->sec))
        dinit_size += 12;
      else
        dinit_size += ((s_sec->sec->size % 4)
                           ? (s_sec->sec->size + (4 - s_sec->sec->size % 4))
                           : s_sec->sec->size)
                          + 12;
    }

  if (pic32_debug)
    printf("  optim_dinit pre padding old_size 0x%x new_size 0x%x\n",
           init_template->size, dinit_size);

  /* 0's for end of section */
#if defined(TARGET_IS_PIC32C)
  dinit_size += 8;
#elif defined(TARGET_IS_PIC32MX) /* Not used on mips but do this anyway */
  dinit_size += 4;
#endif

  /* Cache align - this needs to be done since we are comparing against the
   * untouched init_template which is cache aligned already
   */
  if (dinit_size % 16)
    {
      new_init_data_padding = 16 - (dinit_size % 16);
      dinit_size += new_init_data_padding;
    }

  if (pic32_debug)
    printf("  optim_dinit check_dinit_growth old_size 0x%x new_size 0x%x\n",
           init_template->size, dinit_size);

  if (dinit_size > init_template->size)
    {
      /* We are discarding/re-sizing dinit and will have a new value for
       * 'original' padding before exclusions and merging in
       * estimate_dinit_merging. */
      init_data_padding = new_init_data_padding;
      return dinit_size;
    }
  else
    return 0;
}

void estimate_dinit_merging()
{
  struct pic32_section  *s_sec;
  bfd_size_type         dinit_size, saved_dinit_pre = 0;

  if (!pic32_data_init)
    return;

  BFD_ASSERT (init_template != NULL);

  /* Work around sections added to data_section that got garbage collected
   * this is not necessary once we move dinit to inside the bfa. */
  for (s_sec = data_sections; s_sec; s_sec = s_sec->next)
    if (s_sec && s_sec->sec && (s_sec->sec->size > 0)
        && (s_sec->dinit_type >= DINIT_CLEAR)
        && (s_sec->sec->flags & SEC_EXCLUDE)
#ifdef TARGET_IS_PIC32C
        && (s_sec->sec->init != 0)
#endif
        ) {
      if (pic32_debug)
        printf("  optim_dinit exclude section %s size 0x%x type: %d\n",
               s_sec->sec->name, s_sec->sec->size, s_sec->dinit_type);
      if (s_sec->dinit_type == DINIT_CLEAR)
        saved_dinit += 12;
      else if (s_sec->dinit_type == DINIT_COPY)
        saved_dinit += ((s_sec->sec->size % 4)
                        ? (s_sec->sec->size + (4 - s_sec->sec->size % 4))
                        : s_sec->sec->size) + 12;
      else if (s_sec->dinit_type == DINIT_COPY_VAL_EMB)
        saved_dinit += 12; /* 'save' just the header for the section */
      else if (s_sec->dinit_type == DINIT_COPY_VAL_DATA)
        saved_dinit += 16; /* 'save' the header plus the 1 word entry */
      else if (s_sec->dinit_type == DINIT_COMPRESSED)
        /* 'save' the difference between what is already saved and the header
         * dinit_get_compression_gain will deal with alignment */
        saved_dinit +=
            (s_sec->sec->size - dinit_get_compression_gain(s_sec->sec)) + 12;
    }

  saved_dinit_pre = saved_dinit;

