zeha/xc32/pic32m-source/binutils/bfd/pic32-dinit.c
  if (dinit_compress_level > 0)
    {
      if (pic32_debug)
        fprintf (stderr, "\noptim_dinit estimate merging\n");

      /* scan sections and write data records */
          for (s_sec = data_sections; s_sec != NULL; )
          {
            if ((s_sec)
                && (s_sec->sec)
                && ((s_sec->sec->flags & SEC_EXCLUDE) == 0)
                && (s_sec->sec->output_section != bfd_abs_section_ptr)
                && (s_sec->sec->size > 0))
            {
              s_sec = bfd_pic32_process_merged_sections(s_sec, NULL, FALSE);
            }
            else if (!s_sec)
              break;
            else
              s_sec = s_sec->next;
          }
  }

  /* Align to cache line, this was done before v4.10 - keep it that way
   * We need to remove the original padding as it was calculated on the
   * original size of .dinit. We also cannot remove that original padding
   * in case we are unable to optimize any sections as init_template is
   * already allocated */
  dinit_size = init_template->size - saved_dinit - init_data_padding;

  if (dinit_size % 16)
  {
    init_data_padding = 16 - (dinit_size % 16);
    dinit_size += init_data_padding;
  }


  if (pic32_debug)
    {
      fprintf (stderr,
               "  optim_dinit saved_dinit (merge) MERGE: 0x%lx, TOTAL: 0x%x, "
               "SIZE: 0x%x\n",
               saved_dinit - saved_dinit_pre, saved_dinit, dinit_size);
      if (dinit_compress_level > 0)
        fprintf (stderr, "optim_dinit estimate merging done\n");
    }

  /* We didn't allocate enough memory for the init template or optimized the
   * entire section away (underflow). It may be possible to recover from this
   * but this indicates something has gone wrong with optimization or section
   * selection. */
  BFD_ASSERT (dinit_size <= init_template->size);

  if(!bfd_set_section_size(init_bfd, init_template, dinit_size)) {
    fprintf(stderr, "Link Error: could not resize init_data section, try lower --dinit-compress level.\n");
    abort();
  }
  return;
}

/* root .dinit function */
void
fill_dinit_section(struct bfd_link_info *info)
{
  asection              *dinit_sec;
  bfd_size_type         dinit_size;
  unsigned char         *dat;
  struct pic32_section  *s_sec;
  uint32_t              i;
  Elf_Internal_Shdr     *hdr;

  if (!pic32_data_init)
    return;

    BFD_ASSERT (init_template != NULL);

    if (pic32_debug)
      fprintf (stderr, "\noptim_dinit ... filling DINIT last pass\n");

    dinit_sec = init_template->output_section;
    dinit_size = init_template->size;

    if (!dinit_sec)
      {
        fprintf( stderr, "Link Error: could not access data template\n");
        abort();
      }

    /* clear SEC_IN_MEMORY flag if inaccurate */
    if ((dinit_sec->contents == 0) &&
        ((dinit_sec->flags & SEC_IN_MEMORY) != 0))
      dinit_sec->flags &= ~ SEC_IN_MEMORY;

    if(init_data == NULL)
      {
        init_data = (unsigned char*) malloc(dinit_size * sizeof(unsigned char));
        if (init_data == NULL)
          {
            fprintf (stderr, "Link Error: can't allocate dinit buffer\n");
            abort ();
          }
        memset (init_data, 0x11, dinit_size);
      }

    /* update the default fill value */
    dat = init_data;
    for (i=0; i < dinit_size; i++)
      *dat++ *= 3;

  /* scan sections and write data records */
      if (pic32_debug)
        fprintf(stderr, "\noptim_dinit Filling data sections:\n");

      dat = init_data;
      for (s_sec = data_sections; s_sec != NULL; )
      {
        if ((s_sec)
            && (s_sec->sec)
            && ((s_sec->sec->flags & SEC_EXCLUDE) == 0)
            && (s_sec->sec->output_section != bfd_abs_section_ptr)
            && (s_sec->sec->size > 0))
        {          
          if (pic32_debug)
            fprintf(stderr,
                    "  optim_dinit section %s, type: %d size = 0x%lx bytes\n",
                    s_sec->sec->name, s_sec->dinit_type, s_sec->sec->size);
          switch (dinit_compress_level)
          {
          case 0:
            bfd_pic32_process_data_section(s_sec->sec, &dat);
            s_sec = s_sec->next;
            break;
           
          case 1:
            s_sec =  bfd_pic32_process_merged_sections(s_sec, &dat, TRUE);
            break;

          case 2:
          case 3:
          {
            /* is candidate for repeated values */
            if (((dinit_link_mask & GEN_DINIT_MASK(DINIT_COPY_VAL_EMB)) && (s_sec->dinit_type == DINIT_COPY_VAL_EMB))
                || ((dinit_link_mask & GEN_DINIT_MASK(DINIT_COPY_VAL_DATA)) && ((s_sec->dinit_type == DINIT_COPY_VAL_EMB) || (s_sec->dinit_type == DINIT_COPY_VAL_DATA))))
            {
              dinit_get_entry_type (s_sec, &dat, TRUE);
              s_sec = s_sec->next;
            }
            else if ((dinit_compress_level == 3) 
                    && (dinit_link_mask & GEN_DINIT_MASK(DINIT_COMPRESSED))
                    && (s_sec->dinit_type == DINIT_COMPRESSED)
                    )
            {
              bfd_pic32_compress_data_section(s_sec, &dat); 
              s_sec = s_sec->next;             
            }
            else
              s_sec =  bfd_pic32_process_merged_sections(s_sec, &dat, TRUE);
            break;
          }

          default:
            break;
          }
        }
        else
        {
          if (s_sec == NULL)
            break;
          else
            s_sec = s_sec->next;
        }
      }

      if (pic32_debug)
        fprintf(stderr, "optim_dinit Filling data sections done\n");

#ifdef TARGET_IS_PIC32MX
     if (pic32_code_in_dinit) {
#endif
      if (pic32_debug)
        fprintf(stderr, "\noptim_dinit Filling code sections:\n");
       for (s_sec = code_sections; s_sec != NULL; s_sec = s_sec->next)
         if ((s_sec->sec) &&
             (((s_sec->sec->flags & SEC_EXCLUDE) == 0) &&
              (s_sec->sec->output_section != bfd_abs_section_ptr)))
           {
#if TARGET_IS_PIC32C
             if (s_sec->sec->itcm)
#endif
               bfd_pic32_process_code_section(s_sec, &dat, TRUE);
#ifdef TARGET_IS_PIC32C
         else if ((pic32c_relocate_vectors)
                  && s_sec->sec
                  && (strstr (s_sec->sec->name, ".vectors")
                      != NULL))
           bfd_pic32_process_code_section (s_sec, &dat, FALSE);

#endif
           }
#ifdef TARGET_IS_PIC32MX
     }
#endif
     /* write zero terminator */
       *dat++ = 0; *dat++ = 0;
       *dat++ = 0; *dat++ = 0;
/* as 0x0 (32b) is a valid address on PIC32C devices, the end of .dinit section is marked with 64b */
#ifdef TARGET_IS_PIC32C
       *dat++ = 0; *dat++ = 0;
       *dat++ = 0; *dat++ = 0;
#endif

#ifdef TARGET_IS_PIC32MX
      if (pic32_code_in_dinit)
      {

        struct bfd_link_hash_entry *h;
        h = bfd_link_hash_lookup (info->hash, entry_symbol_copy.name,
                                  FALSE, FALSE, TRUE);
        if (h != NULL
            && (h->type == bfd_link_hash_defined
                || h->type == bfd_link_hash_defweak)
            && h->u.def.section->output_section != NULL)
        {
        bfd_vma entry_address;

        entry_address = h->u.def.value
                        + bfd_get_section_vma (info->output_bfd,
                                    h->u.def.section->output_section)
                        + h->u.def.section->output_offset;


        *dat++ = entry_address & 0xFF;
        *dat++ = (entry_address >> 8) & 0xFF;
        *dat++ = (entry_address >> 16) & 0xFF;
        *dat++ = (entry_address >> 24) & 0xFF;
        }
      }
#endif

