zeha/xc32/pic32m-source/binutils/bfd/pic32-dinit.c
  if (pic32_debug)
    fprintf(stderr, "\noptim_dinit last template addr written = %lx\n",
           (long unsigned int)(dat-1));

  hdr = &elf_section_data (dinit_sec)->this_hdr;
  hdr->sh_size = dinit_sec->size;
  dinit_sec->flags |= SEC_LINKER_CREATED;
  init_template->flags |= SEC_LINKER_CREATED;
}

void
set_dinit_content(bfd *abfd, struct bfd_link_info *info);
void
set_dinit_content(bfd *abfd, struct bfd_link_info *info)
{
  asection              *dinit_sec;
  bfd_size_type         dinit_size;
  file_ptr              dinit_offset;
  fill_dinit_section(info);

  if (!pic32_data_init)
    return;

  dinit_sec = init_template->output_section;
  dinit_size = init_template->size;
  dinit_offset = init_template->output_offset;

  bfd_seek(dinit_sec->owner, 0, SEEK_SET);

  if (!bfd_set_section_contents (abfd, dinit_sec,
                                 init_data, dinit_offset, dinit_size))
  {
      fprintf(stderr, "Link Error: can't write section %s contents\n",
              dinit_sec->name);
      abort();
  }
}

  /*
  * Simulate the consumption of .dinit section
  * emit linker error if the structure is not valid
  * the purpose of this check is to avoid 
  * a runtime fault  
  */
void check_dinit_content(struct bfd_link_info *info);
void check_dinit_content(struct bfd_link_info *info)
{
  asection            *dinit_sec;
  bfd_size_type       dinit_size;
  int32_t             i, j, padding_count;
  uint32_t            *dinit_ptr;
  uint8_t             *dinit_content;

  if (!pic32_data_init)
    return;

  if(!dinit_self_check)
    return;

  BFD_ASSERT (init_template != NULL);

  dinit_sec = init_template->output_section;
  dinit_size = init_template->size;

  dinit_content = (unsigned char *)malloc(dinit_size);

  bfd_seek(dinit_sec->owner, 0, SEEK_SET);

  if( !bfd_get_section_contents(dinit_sec->owner, dinit_sec, dinit_content,
                                  init_template->output_offset, dinit_size))
  {
    fprintf(stderr, "Link Error: can't load section .dinit contents\n");
    abort();
  }

  if (pic32_debug)
    fprintf(stderr, "\noptim_dinit check: dinit size 0x%x\n", dinit_size);

  for (i = 0, dinit_ptr = (uint32_t*)(dinit_content); i < dinit_size/4; )
    {
      uint32_t addr;       ///\ address to write to
      int32_t length;      ///\ number of bytes to write
      uint16_t entry_type; ///\ encoding type
      uint8_t  *dat;
      uint32_t delta;
      /* check and consume termination sequence
       *  pic32m 0x00000000
       *  pic32c 0x00000000 0x00000000
       */
      if (*dinit_ptr == 0x0)
        {
#ifdef TARGET_IS_PIC32C
          if (*(dinit_ptr+1) == 0x0)
            {
              i++;
              dinit_ptr++;
#endif
          i++;
          dinit_ptr++;
          free (dinit_content);
          /* We are at the end of dinit data now, count padding */
          for (padding_count = 0; i < dinit_size/4;
               i++,padding_count++,dinit_ptr++) {}

          if (pic32_debug)
            fprintf (stderr,
                     "\n  optim_dinit check: padding amount: %d bytes\n",
                     padding_count);
          /* At most we need 3 words of padding for 16 byte alignment. We don't
           * need to abort as this won't cause a runtime error, only waste space
           */
          if (padding_count > 3)
            if (pic32_debug)
              fprintf (stderr,
                       "\b optim_dinit: Too much .dinit section padding: %d"
                       " bytes\n",
                       padding_count);
          return;
#ifdef TARGET_IS_PIC32C
            }
#endif
        }

      /* address - 4 bytes */
      addr        = *dinit_ptr; dinit_ptr++;
      length      = *dinit_ptr; dinit_ptr++;
      entry_type  = (uint16_t)*dinit_ptr; dinit_ptr++;
      i += 3;  /* dinit entry header length */

      if (pic32_debug)
        fprintf(stderr,
                "\n  optim_dinit check: entry addr: 0x%lx size: 0x%lx type: "
                "0x%lx\n",
                (long unsigned int)addr, (long unsigned int)length,
                (long unsigned int)entry_type);

      switch (entry_type)
        {
        case DINIT_CLEAR:
        case DINIT_COPY_VAL_EMB:
          break;

        case DINIT_COPY:
          delta = (length/4) + ((length%4 != 0)? 1:0);
          dinit_ptr += delta;
          i += delta;
          break;

        case DINIT_COPY_VAL_DATA:
          dinit_ptr++; i++;
          break;

        case DINIT_COMPRESSED:
          for (j = 0, dat = (uint8_t*)dinit_ptr; j < length; )
            {
              if (*dat != 0)
                {
                  dat++; j++;
                }
              else
                {
                  dat++; j+= *dat++;
                }
            }
          delta = (((uint32_t)dat - (uint32_t)dinit_ptr)/4 +
                   ((((uint32_t)dat % 4) != 0) ? 1 : 0));
          dinit_ptr += delta;
          i += delta;
          break;

        default:
          ///\ link error -> not expected type
          fprintf(stderr, "Link Error: Unexpected .dinit entry type %d\n",
                  (uint32_t)entry_type);
          abort();
          break;
        }
    }

  /*
   * malformed .dinit section
   */
  free (dinit_content);
  fprintf(stderr, "Link Error: Malformed .dinit section\n");
  abort();
}
#endif /* __PIC32_DINIT__ */
